{
  "name": "Config Card",
  "icon": "modulargolems:white_config_card",
  "category": "modulargolems:golems",
  "sortnum": 31,
  "pages": [
	{
	  "type": "patchouli:spotlight",
	  "item": "modulargolems:white_config_card",
	  "text": "Right click golem to set config. Right click again to remove. When in offhand, wands would only target golems having this config.$(br2)Rename the item and right click to set the item name as config name. All card from the same owner and same color are in fact the same config."
	},
	{
	  "type": "patchouli:text",
	  "text": "In config menu, put golem in to set golem to have this config. You can choose the default mode for golem when golems are summoned. And you can set whether golems should spawn at old location or current location when they were retrieved.$(br2)Note that golem will only be summoned in previous location if that location is within 64 blocks and golem is not in following mode."
	},
	{
	  "type": "patchouli:text",
	  "text": "You can also lock golem interaction, so that you would not accidentally pick them up, or change their weapons, even when you have the card in offhand. If you lost the card, you can make a new one of the same color to unlock golems. $(br2)You can also configure item filters for pickup upgrade. This is helpful to not accidentally pickup unwanted items or destroy valuables."
	},
	{
	  "type": "patchouli:spotlight",
	  "item": "modulargolems:target_filter_type,modulargolems:target_filter_uuid,modulargolems:target_filter_name,modulargolems:target_filter_default",
	  "text": "You can configure golem attack targets. The hostile target list contains targets golems will actively attack. The friendly target list containers targets golems will never attack.$(br2)There are default cards but you can remove them and insert your own, so that you can use golems to fight other golems or other players."
	},
	{
	  "type": "patchouli:spotlight",
	  "item": "modulargolems:patrol_path_recorder",
	  "text": "You can configure golem patrol path in config. Craft Patrol Path Recorder and record a circular path by clicking with it. When Create is installed, it will render the path and direction of movement a well. The path is fur guidance only. Golem will not always step on the exact block."
	}
  ]
}